#define _CRT_SECURE_NO_WARNINGS


#include <wchar.h>
#include <HttpExt.h>

#include "Context.h"

/*для отладки нужно цеплять w3wp.exe*/

//точка входа в dll
BOOL WINAPI DllMain(HINSTANCE hinstDLL, DWORD fdwReason, LPVOID lpReserved){
	BOOL isOk = 1;
	switch (fdwReason) {
	case DLL_PROCESS_ATTACH: //новый процесс имеет доступ к DLL
		isOk = utilities::initDLL();
		break;
	case DLL_THREAD_ATTACH:  //новый поток получает доступ к DLL

		break;
	case DLL_THREAD_DETACH:  //поток(последний?) отсоединяется от DLL

		break;
	case DLL_PROCESS_DETACH: //процесс(один из потоков?) отсоединяется от DLL

		break;
	}

	return isOk;
}


BOOL WINAPI GetExtensionVersion(HSE_VERSION_INFO *pVersion) {	
	pVersion->dwExtensionVersion = MAKELONG(HSE_VERSION_MINOR, HSE_VERSION_MAJOR);

	lstrcpyn(pVersion->lpszExtensionDesc, "ISAPI module for Cognas TM1", HSE_MAX_EXT_DLL_NAME_LEN);

	return TRUE;
}

DWORD WINAPI HttpExtensionProc(EXTENSION_CONTROL_BLOCK *pECB) {
	std::string response = "Content-Type: text/html; charset=utf-8\r\n\r\n";
	if (std::strcmp(pECB->lpszMethod, "POST") == 0) {
		//извлекаем содержание запроса
		CHAR * buf = new CHAR[pECB->cbTotalBytes+1];
		std::memset(buf, 0, pECB->cbTotalBytes + 1);
		std::strncat(buf, (CHAR*)pECB->lpbData, pECB->cbTotalBytes);
		buf[pECB->cbTotalBytes] = '\0';
		
		//дочитываем остальные данные
		DWORD total = pECB->cbTotalBytes - (DWORD)std::strlen(buf);
		char * b = buf+ pECB->cbTotalBytes- total;
		while (total) {
			DWORD len = total;
			if(!pECB->ReadClient(pECB->ConnID, b, &len))
				break; //ошибка чтения
			total -= len;
			b += len;
		}

		
		//декодируем
		wchar_t *wText2 = utilities::CodePageToUnicode(65001, buf);
		delete[] buf;
		char *ansiText = utilities::UnicodeToCodePage(1251, wText2);
		delete[] wText2;
		//парсим				
		try {
			Context context(ansiText,
				false,
				R"(C:\Users\etyurin\Documents\Visual Studio 2017\Projects\CognosTM1\Debug\ssl\tm1ca_v2.pem)");
			response += "OK";
		}catch (std::exception &e) {
			const char * buf = e.what();
			//декодируем
			wchar_t *wText = utilities::CodePageToUnicode(1251, buf);
			char *utf8Text = utilities::UnicodeToCodePage(65001, wText);
			delete[] wText;
			response += utf8Text;
			delete[] utf8Text;
		}

		//освобождаем ресурсы
		delete[] ansiText;
		
	}else {
		const char * buf = R"(
{
	"adminServer":"as-msk-a0134",
	"server"    :{"name":"S2018",
	              "login":"admin",
	              "pwd":""},	
	
	"delete":[
		{"cube":"Лимиты"},
		{"subsets":{
				   "dimension":"Период_",
		           "names"    :["2011-2012","2013"]}
		},		
		{"dimension":"Период_"},
		{"dimension":"ЦФО_"},
		{"dimension":"Статья бюджета"},
		{"dimension":"Регион_"},
		{"dimension":"Проект_"},
		{"dimension":"Подразделение_"}
		
	],
	 
	"create":[
		{"dimension":{"name"     :"Подразделение_",
		              "elements" :["Подразделение_A","Подразделение_B","Подразделение_C","Подразделение_D","Подразделение_E"]}
		},
		{"dimension":{"name"     :"Период_",
		              "elements" :["2011.01.01","2011.02.01","2011.03.01","2011.04.01","2011.05.01","2011.06.01","2011.07.01","2011.08.01","2011.09.01","2011.10.01","2011.11.01","2011.12.01","2012.01.01","2012.02.01","2012.03.01","2012.04.01","2012.05.01","2012.06.01","2012.07.01","2012.08.01","2012.09.01","2012.10.01","2012.11.01","2012.12.01","2013.01.01","2013.02.01","2013.03.01","2013.04.01","2013.05.01","2013.06.01","2013.07.01","2013.08.01","2013.09.01","2013.10.01","2013.11.01","2013.12.01","2014.01.01","2014.02.01","2014.03.01","2014.04.01","2014.05.01","2014.06.01","2014.07.01","2014.08.01","2014.09.01","2014.10.01","2014.11.01","2014.12.01","2015.01.01","2015.02.01","2015.03.01","2015.04.01","2015.05.01","2015.06.01","2015.07.01","2015.08.01","2015.09.01","2015.10.01","2015.11.01","2015.12.01","2016.01.01","2016.02.01","2016.03.01","2016.04.01","2016.05.01","2016.06.01","2016.07.01","2016.08.01","2016.09.01","2016.10.01","2016.11.01","2016.12.01","2017.01.01","2017.02.01","2017.03.01","2017.04.01","2017.05.01","2017.06.01","2017.07.01","2017.08.01","2017.09.01","2017.10.01"]}
        },
		{"subset"   :{"dimension":"Период_",
					  "name"     :"2013",                      
		              "elements" :["2013.01.01","2013.02.01","2013.03.01","2013.04.01","2013.05.01","2013.06.01","2013.07.01","2013.08.01","2013.09.01","2013.10.01","2013.11.01","2013.12.01"]}
        }, 
		{"subset"   :{"dimension":"Период_",
					  "name"     :"2011-2012",
					  "MDX"      :"{TM1FILTERBYPATTERN(TM1SUBSETALL([Период_]),\"2011.*\"),
                                    TM1FILTERBYPATTERN(TM1SUBSETALL([Период_]),\"2012.*\")}"}
        }, 
		{"dimension":{"name"     :"ЦФО_",
		              "elements" :["ЦФО_1","ЦФО_2","ЦФО_3","ЦФО_4","ЦФО_5"]}
		},
		{"dimension":{"name"     :"Статья бюджета",
		              "elements" :["Статья_1","Статья_2","Статья_3","Статья_4","Статья_5"]}
	    },
	    {"dimension":{"name"     :"Регион_",
		              "elements" :["Регион_1","Регион_2","Регион_3","Регион_4","Регион_5","Регион_6"]}
        },
		{"dimension":{"name"     :"Проект_",
		              "elements" :["Проект_1","Проект_2","Проект_3","Проект_4"]}
        },
		{"cube"     :{"name"      :"Лимиты",
		              "dimensions":["Период_","ЦФО_","Статья бюджета","Регион_","Проект_","Подразделение_"]}
		}
	],

	"set":[	{"cube":{"name":"Лимиты",
					 "val" : [	{ "1":"2014.04.01", "2" : "ЦФО_1", "3" : "Статья_1", "4" : "Регион_1", "5" : "Проект_1", "6" : "Подразделение_A", "v" : 100.00 },
								{ "1":"2014.04.01", "2" : "ЦФО_1", "3" : "Статья_2", "4" : "Регион_1", "5" : "Проект_2", "6" : "Подразделение_A", "v" : 200.00 },
								{ "1":"2014.04.01", "2" : "ЦФО_1", "3" : "Статья_3", "4" : "Регион_1", "5" : "Проект_3", "6" : "Подразделение_A", "v" : 300.00 },
								{ "1":"2014.04.01", "2" : "ЦФО_1", "3" : "Статья_1", "4" : "Регион_1", "5" : "Проект_4", "6" : "Подразделение_A", "v" : 400.00 },
								{ "1":"2014.04.01", "2" : "ЦФО_1", "3" : "Статья_1", "4" : "Регион_1", "5" : "Проект_2", "6" : "Подразделение_A", "v" : 500.00 },
								{ "1":"2014.04.01", "2" : "ЦФО_2", "3" : "Статья_1", "4" : "Регион_1", "5" : "Проект_1", "6" : "Подразделение_A", "v" : 600.00 },
								{ "1":"2014.04.01", "2" : "ЦФО_2", "3" : "Статья_2", "4" : "Регион_1", "5" : "Проект_2", "6" : "Подразделение_A", "v" : 700.00 },
								{ "1":"2014.04.01", "2" : "ЦФО_2", "3" : "Статья_3", "4" : "Регион_1", "5" : "Проект_3", "6" : "Подразделение_A", "v" : 800.00 },
								{ "1":"2014.04.01", "2" : "ЦФО_2", "3" : "Статья_1", "4" : "Регион_1", "5" : "Проект_4", "6" : "Подразделение_A", "v" : 900.00 },
								{ "1":"2014.04.01", "2" : "ЦФО_2", "3" : "Статья_4", "4" : "Регион_1", "5" : "Проект_2", "6" : "Подразделение_A", "v" : 1000.00},
								{ "1":"2011.04.01", "2" : "ЦФО_1", "3" : "Статья_1", "4" : "Регион_1", "5" : "Проект_1", "6" : "Подразделение_A", "v" : 1100.00},
								{ "1":"2011.04.01", "2" : "ЦФО_1", "3" : "Статья_2", "4" : "Регион_1", "5" : "Проект_2", "6" : "Подразделение_A", "v" : 1200.00},
								{ "1":"2011.04.01", "2" : "ЦФО_1", "3" : "Статья_3", "4" : "Регион_1", "5" : "Проект_3", "6" : "Подразделение_A", "v" : 1300.00},
								{ "1":"2011.04.01", "2" : "ЦФО_1", "3" : "Статья_1", "4" : "Регион_1", "5" : "Проект_4", "6" : "Подразделение_A", "v" : 1400.00},
								{ "1":"2011.04.01", "2" : "ЦФО_1", "3" : "Статья_1", "4" : "Регион_1", "5" : "Проект_2", "6" : "Подразделение_A", "v" : 1500.00},
								{ "1":"2011.04.01", "2" : "ЦФО_2", "3" : "Статья_1", "4" : "Регион_1", "5" : "Проект_1", "6" : "Подразделение_A", "v" : 1600.00},
								{ "1":"2011.04.01", "2" : "ЦФО_2", "3" : "Статья_2", "4" : "Регион_1", "5" : "Проект_2", "6" : "Подразделение_A", "v" : 1700.00},
								{ "1":"2011.04.01", "2" : "ЦФО_2", "3" : "Статья_3", "4" : "Регион_1", "5" : "Проект_3", "6" : "Подразделение_A", "v" : 1800.00},
								{ "1":"2011.04.01", "2" : "ЦФО_2", "3" : "Статья_1", "4" : "Регион_1", "5" : "Проект_4", "6" : "Подразделение_A", "v" : 1900.00},
								{ "1":"2012.04.01", "2" : "ЦФО_2", "3" : "Статья_4", "4" : "Регион_1", "5" : "Проект_2", "6" : "Подразделение_A", "v" : 2000.00},
								{ "1":"2012.04.01", "2" : "ЦФО_3", "3" : "Статья_1", "4" : "Регион_1", "5" : "Проект_1", "6" : "Подразделение_A", "v" : 100.00 },
								{ "1":"2012.04.01", "2" : "ЦФО_3", "3" : "Статья_2", "4" : "Регион_1", "5" : "Проект_2", "6" : "Подразделение_A", "v" : 200.00 },
								{ "1":"2012.04.01", "2" : "ЦФО_3", "3" : "Статья_3", "4" : "Регион_1", "5" : "Проект_3", "6" : "Подразделение_A", "v" : 300.00 },
								{ "1":"2012.04.01", "2" : "ЦФО_3", "3" : "Статья_1", "4" : "Регион_1", "5" : "Проект_4", "6" : "Подразделение_A", "v" : 400.00 },
								{ "1":"2012.04.01", "2" : "ЦФО_3", "3" : "Статья_1", "4" : "Регион_1", "5" : "Проект_2", "6" : "Подразделение_A", "v" : 500.00 },
								{ "1":"2012.04.01", "2" : "ЦФО_2", "3" : "Статья_1", "4" : "Регион_1", "5" : "Проект_1", "6" : "Подразделение_A", "v" : 600.00 },
								{ "1":"2012.04.01", "2" : "ЦФО_2", "3" : "Статья_2", "4" : "Регион_1", "5" : "Проект_2", "6" : "Подразделение_A", "v" : 700.00 },
								{ "1":"2012.04.01", "2" : "ЦФО_2", "3" : "Статья_3", "4" : "Регион_1", "5" : "Проект_3", "6" : "Подразделение_A", "v" : 800.00 },
								{ "1":"2013.04.01", "2" : "ЦФО_2", "3" : "Статья_1", "4" : "Регион_1", "5" : "Проект_4", "6" : "Подразделение_A", "v" : 900.00 },
								{ "1":"2013.04.01", "2" : "ЦФО_2", "3" : "Статья_4", "4" : "Регион_1", "5" : "Проект_2", "6" : "Подразделение_A", "v" : 1000.00},
								{ "1":"2013.04.01", "2" : "ЦФО_1", "3" : "Статья_1", "4" : "Регион_1", "5" : "Проект_1", "6" : "Подразделение_A", "v" : 100.00 },
								{ "1":"2013.04.01", "2" : "ЦФО_1", "3" : "Статья_2", "4" : "Регион_1", "5" : "Проект_2", "6" : "Подразделение_A", "v" : 200.00 },
								{ "1":"2013.04.01", "2" : "ЦФО_1", "3" : "Статья_3", "4" : "Регион_1", "5" : "Проект_3", "6" : "Подразделение_A", "v" : 300.00 },
								{ "1":"2013.04.01", "2" : "ЦФО_1", "3" : "Статья_1", "4" : "Регион_1", "5" : "Проект_4", "6" : "Подразделение_A", "v" : 400.00 },
								{ "1":"2015.04.01", "2" : "ЦФО_1", "3" : "Статья_1", "4" : "Регион_1", "5" : "Проект_2", "6" : "Подразделение_A", "v" : 500.00 },
								{ "1":"2015.04.01", "2" : "ЦФО_2", "3" : "Статья_1", "4" : "Регион_1", "5" : "Проект_1", "6" : "Подразделение_A", "v" : 600.00 },
								{ "1":"2015.04.01", "2" : "ЦФО_2", "3" : "Статья_2", "4" : "Регион_1", "5" : "Проект_2", "6" : "Подразделение_A", "v" : 700.00 },
								{ "1":"2015.04.01", "2" : "ЦФО_2", "3" : "Статья_3", "4" : "Регион_1", "5" : "Проект_3", "6" : "Подразделение_A", "v" : 800.00 },
								{ "1":"2015.04.01", "2" : "ЦФО_2", "3" : "Статья_1", "4" : "Регион_1", "5" : "Проект_4", "6" : "Подразделение_A", "v" : 900.00 },
								{ "1":"2015.04.01", "2" : "ЦФО_2", "3" : "Статья_4", "4" : "Регион_1", "5" : "Проект_2", "6" : "Подразделение_A", "v" : 1000.00}]
			        }
		    }]
}
)";
		//декодируем
		wchar_t *wText = utilities::CodePageToUnicode(1251, buf);
		char *utf8Text = utilities::UnicodeToCodePage(65001, wText);
		delete[] wText;
		response += utf8Text;
		delete[] utf8Text;
	}

	//отправляем клиенту
	if (!pECB->ServerSupportFunction(pECB->ConnID, HSE_REQ_SEND_RESPONSE_HEADER, NULL, NULL, (LPDWORD)response.c_str())) {
		return HSE_STATUS_ERROR;
	}
	else {
		/*новый статус (теперь уже 200)*/
		pECB->dwHttpStatusCode = 200;
	}
	return HSE_STATUS_SUCCESS;

	
	////Sleep(15000);

	///*это наш буфер, где мы сформируем ответ клиенту*/
	//CHAR szBuff[4096];
	//CHAR szTempBuf[4096];

	///*пока нет статуса результата (вроде 200 или 404)*/
	//pECB->dwHttpStatusCode = 0;

	///*формируем ответ*/
	//wsprintf(szBuff, "Content-Type: text/html\r\n\r\n"
	//	"<HTML><HEAD><TITLE>Пример расширения ISAPI</TITLE></HEAD>\n"
	//	"<BODY BGCOLOR=#FFFFFF><H2>Hi from ISAPI Extension!</H2>\n");

	//
	//strcat(szBuff, "<HR>");
	//wsprintf(szTempBuf, "<P>Extension Version: %d.%d\n", HIWORD(pECB->dwVersion), LOWORD(pECB->dwVersion));
	//strcat(szBuff, szTempBuf);
	//wsprintf(szTempBuf, "<BR>Method: %s(Метод)\n", pECB->lpszMethod);
	//strcat(szBuff, szTempBuf);
	//wsprintf(szTempBuf, "<BR>QueryString: %s\n", pECB->lpszQueryString);
	//strcat(szBuff, szTempBuf);
	//wsprintf(szTempBuf, "<BR>PathTranslated: %s\n", pECB->lpszPathTranslated);
	//strcat(szBuff, szTempBuf);
	//wsprintf(szTempBuf, "<BR>TotalBytes: %d\n", pECB->cbTotalBytes);
	//strcat(szBuff, szTempBuf);
	//wsprintf(szTempBuf, "<BR>ContentType: %s\n", pECB->lpszContentType);
	//strcat(szBuff, szTempBuf);

	//strcat(szBuff, "<HR><P><B>Server Variables:</B><BR>\nALL_HTTP: ");
	//DWORD dwSize = 4096;
	//pECB->GetServerVariable(pECB->ConnID, (LPSTR)"ALL_HTTP", (LPVOID)szTempBuf, &dwSize);
	//strcat(szBuff, szTempBuf);

	//strcat(szBuff, "<BR>\nAPPL_PHYSICAL_PATH: ");
	//dwSize = 4096;
	//pECB->GetServerVariable(pECB->ConnID, (LPSTR)"APPL_PHYSICAL_PATH", (LPVOID)szTempBuf, &dwSize);
	//strcat(szBuff, szTempBuf);

	//strcat(szBuff, "<BR>\nHTTP_ACCEPT: ");
	//dwSize = 4096;
	//pECB->GetServerVariable(pECB->ConnID, (LPSTR)"HTTP_ACCEPT", (LPVOID)szTempBuf, &dwSize);
	//strcat(szBuff, szTempBuf);

	//strcat(szBuff, "</BODY></HTML>");

	///*отправляем клиенту*/
	//if (!pECB->ServerSupportFunction(pECB->ConnID, HSE_REQ_SEND_RESPONSE_HEADER, NULL, NULL, (LPDWORD)szBuff)) {
	//	return HSE_STATUS_ERROR;
	//}
	//else {
	//	/*новый статус (теперь уже 200)*/
	//	pECB->dwHttpStatusCode = 200;
	//}
	//return HSE_STATUS_SUCCESS;
}

BOOL  WINAPI   TerminateExtension(DWORD dwFlags) {
	
	return utilities::releasDLL();
}